// 5. Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.
public class Hypotenuse {
    public static void main(String[] args) {
        double a = 6;
        double b = 9;
        double с = a*a + b*b;
        System.out.println(Math.sqrt(с));
    }
}
