// 6. Дано натуральное число. Выведите его последнюю цифру.
public class Last_Digit {
    public static void main(String[] args) {
        int a = 369;
        int b = a % 10;
        System.out.println(b);
    }
}
