// 2. Создайте переменную, присвойте ей целочисленное значение. Выведите значение на экран
public class Number {
    public static void main(String[] args) {
        int x=1;
        System.out.println(x);
    }
}