// 3. Создайте переменную, увеличьте её на единицу несколькими способами и выведите значение на экран.
public class Number_1 {
    public static void main(String[] args) {
        int a = 4;
        int a1 = 4;
        int b = 1;
        int c = (a + b);
        int d =++ a;
        int e = a1 += b;
        System.out.println(c);
        System.out.println(d);
        System.out.println(e);
    }
}
