// 8. Дано двузначное число. Найдите число десятков в нем.
public class Ten_2 {
    public static void main(String[] args) {
        int a = 12;
        int b = a / 10 % 10;
        System.out.println(b);
    }
}
